// Вывести квадрат целого числа
Console.WriteLine("Найти квадрат целого числа ");
Console.WriteLine("Введите значение целого числа ");
int numberA = Convert.ToInt32(Console.ReadLine());
int result = numberA * numberA;
Console.Write("Итог: ");
Console.WriteLine(result);